DangLamTung/stm32code/drone_code/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define CE_nRF24_Pin GPIO_PIN_3
#define CE_nRF24_GPIO_Port GPIOA
#define CSN_nRF24_Pin GPIO_PIN_4
#define CSN_nRF24_GPIO_Port GPIOA
#define SCK_nRF24_Pin GPIO_PIN_5
#define SCK_nRF24_GPIO_Port GPIOA
#define MISO_nRF24_Pin GPIO_PIN_6
#define MISO_nRF24_GPIO_Port GPIOA
#define MOSI_nRF24_Pin GPIO_PIN_7
#define MOSI_nRF24_GPIO_Port GPIOA
#define IRQ_nRF24_Pin GPIO_PIN_4
#define IRQ_nRF24_GPIO_Port GPIOC
#define ECHO_Pin GPIO_PIN_7
#define ECHO_GPIO_Port GPIOC
#define ESC4_Pin GPIO_PIN_8
#define ESC4_GPIO_Port GPIOA
#define ESC3_Pin GPIO_PIN_9
#define ESC3_GPIO_Port GPIOA
#define ESC2_Pin GPIO_PIN_10
#define ESC2_GPIO_Port GPIOA
#define ESC1_Pin GPIO_PIN_11
#define ESC1_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
